src/cf/src/AccumulationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Зарплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/InformationRegisters/ПлановыеПоказатели/ПлановыеПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеПоказатели</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>План</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Факт</name>
    <type>
      <types>Characteristic.ПоказателиРасчётаПремий</types>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПоказателиРасчётаПремий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDРодитель</name>
    <comment>Для связи в виде &quot;Дерево&quot;</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ТарифныеСтавки/ТарифныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифныеСтавки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОклада</name>
    <type>
      <types>EnumRef.ВариантыОклада</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ВидыНачисленийЗарплаты/ВидыНачисленийЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНачисленийЗарплаты</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ПоказателиПродаж/ПоказателиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиПродаж</name>
  <enumValues>
    <name>Выручка</name>
  </enumValues>
  <enumValues>
    <name>ВыручкаОтОплат</name>
  </enumValues>
  <enumValues>
    <name>Оплаты</name>
  </enumValues>
  <enumValues>
    <name>Прибыль</name>
  </enumValues>
  <enumValues>
    <name>Количество</name>
  </enumValues>
  <enumValues>
    <name>Рентабельность</name>
  </enumValues>
  <enumValues>
    <name>ЧистаяПрибыль</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ВариантыАнализаПоказателей/ВариантыАнализаПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыАнализаПоказателей</name>
  <enumValues>
    <name>ПоСотруднику</name>
  </enumValues>
  <enumValues>
    <name>ПоСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделению</name>
  </enumValues>
  <enumValues>
    <name>ПоПодразделениям</name>
  </enumValues>
  <enumValues>
    <name>ПоОрганизации</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <basedOn>Document.ТабельУчётаРабочегоВремени</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ТабельУчётаРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ВыплатаЗарплаты/ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатаЗарплаты</name>
  <basedOn>Document.НачислениеЗарплаты</basedOn>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.НачислениеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/Зарплата/ManagerModule.bsl
#Область Формирование_движений 
 
Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Если ДокОбъект.Дата < Константы.ДатаНачалаРасчетаЗарплаты.Получить() Тогда Возврат; КонецЕсли;
	Движения = ДокОбъект.Движения;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НачислениеЗарплаты") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	&Период КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.НачислениеПоТабелю) КАК СтатьяЗатрат,
		                      |	ТЧСотрудники.Оклад КАК Сумма
		                      |ИЗ
		                      |	Документ.НачислениеЗарплаты.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док
		                      |	И НЕ ТЧСотрудники.Оклад = 0
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	&Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		                      |	ТЧСотрудники.Сотрудник,
		                      |	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.Премия),
		                      |	ТЧСотрудники.Премия
		                      |ИЗ
		                      |	Документ.НачислениеЗарплаты.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док
		                      |	И НЕ ТЧСотрудники.Премия = 0");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВыплатаЗарплаты") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧСотрудники.Ссылка.Дата КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ТЧСотрудники.Сумма КАК Сумма
		                      |ИЗ
		                      |	Документ.ВыплатаЗарплаты.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПлатёжнаяВедомостьНаАванс") Тогда	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧСотрудники.Ссылка.Дата КАК Период,
		                      |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ТЧСотрудники.Сумма КАК Сумма,
		                      |	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ВыплатаАванса) КАК СтатьяЗатрат
		                      |ИЗ
		                      |	Документ.ПлатёжнаяВедомостьНаАванс.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить()); 
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриказНаНачислениеУдержание") Тогда	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТЧСотрудники.Ссылка.Дата КАК Период,
		                      |	ВЫБОР
		                      |		КОГДА ТЧСотрудники.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийЗарплаты.Начисление)
		                      |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		                      |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		                      |	КОНЕЦ КАК ВидДвижения,
		                      |	ТЧСотрудники.Сотрудник КАК Сотрудник,
		                      |	ВЫБОР
		                      |		КОГДА ТЧСотрудники.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачисленийЗарплаты.Начисление)
		                      |			ТОГДА ТЧСотрудники.Сумма
		                      |		ИНАЧЕ ТЧСотрудники.Сумма
		                      |	КОНЕЦ КАК Сумма,
		                      |	ТЧСотрудники.СтатьяЗатрат КАК СтатьяЗатрат
		                      |ИЗ
		                      |	Документ.ПриказНаНачислениеУдержание.ТЧСотрудники КАК ТЧСотрудники
		                      |ГДЕ
		                      |	ТЧСотрудники.Ссылка = &Док");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
		Движения.Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
		Если ДокОбъект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда Возврат КонецЕсли;
		НС = Движения.Зарплата.ДобавитьРасход();
		НС.Период = ?(ЗначениеЗаполнено(ДокОбъект.ПериодРасчетаЗарплаты),ДокОбъект.ПериодРасчетаЗарплаты,ДокОбъект.Дата);
		НС.Сотрудник = ДокОбъект.Контрагент;
		НС.Сумма = ДокОбъект.Сумма;
		НС.СтатьяЗатрат = ДокОбъект.СтатьяДДС;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		Если ДокОбъект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда Возврат КонецЕсли;
		Если ЗначениеЗаполнено(ДокОбъект.Основание) Тогда
			Для Каждого Стр из ДокОбъект.Основание.ТЧСотрудники Цикл 
				НС = Движения.Зарплата.ДобавитьРасход();
				НС.Период = ДокОбъект.Дата;
				НС.Сотрудник = Стр.Сотрудник;
				НС.Сумма = Стр.Сумма;
				НС.СтатьяЗатрат = ДокОбъект.СтатьяДДС;
			КонецЦикла;
		Иначе
			НС = Движения.Зарплата.ДобавитьРасход();
			НС.Период = ДокОбъект.Дата;
			НС.Сотрудник = ДокОбъект.Контрагент;
			НС.Сумма = ДокОбъект.Сумма;
			НС.СтатьяЗатрат = ДокОбъект.СтатьяДДС;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры		

#КонецОбласти

#Область Расчёт_зарплаты

// Рассчитывает зарплату сотрудника за месяц: оклад, премию, прочие начисления и удержания.
//
// Параметры:
//  Сотрудник - СправочникСсылка.ФизическиеЛица - сотрудник.
//  Дата - Дата - любая дата месяца начисления.
//  КэшРасчета - Структура, Неопределено - кэш расчёта премий (см. НовыйКэшРасчетаПремий). При расчёте
//    нескольких сотрудников за один месяц передавать один и тот же кэш: суммы продаж по одинаковым
//    отборам считаются одним запросом на документ.
//
// Возвращаемое значение:
//  Структура - Оклад (Структура), Премия (Структура: Сумма, ТЗПоказатели, ТЗШтрафы), Прочее (Структура), Итого (Число).
//
Функция РассчитатьПоСотруднику(Сотрудник, Дата, КэшРасчета = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Кэш = ?(КэшРасчета = Неопределено, НовыйКэшРасчетаПремий(), КэшРасчета);
	Результат = Новый Структура;
	Результат.Вставить("Оклад", РассчитатьОклад(Сотрудник, Дата));
	Результат.Вставить("Премия", РассчитатьПремию(Сотрудник, Дата, Результат.Оклад, Кэш));
	Результат.Вставить("Прочее", РассчитатьПрочиеНачисленияУдержания(Сотрудник, Дата));
	Итого = Результат.Оклад.Сумма + Результат.Премия.Сумма;
	Результат.Вставить("Итого", Итого + Результат.Прочее.ВсегоНачислено - Результат.Прочее.ВсегоУдержано);
	Возврат Результат;
КонецФункции

// Создаёт кэш расчёта премий: суммы показателей продаж по отборам месяца.
//
// Возвращаемое значение:
//  Структура - СуммыПоОтборам (Соответствие: ключ отбора - сумма), СуммыПоПродавцам (Соответствие: ключ отбора -
//  Соответствие продавец - сумма).
//
Функция НовыйКэшРасчетаПремий() Экспорт
	Возврат Новый Структура("СуммыПоОтборам, СуммыПоПродавцам", Новый Соответствие, Новый Соответствие);
КонецФункции

Функция РассчитатьОклад(Сотрудник, Период) Экспорт
	СтруктураОтработанноеВремя = РегистрыСведений.ОтработанноеВремяСотрудников.ПолучитьЗаМесяц(Период, Сотрудник);
	Результат = Новый Структура;
	Результат.Вставить("Сумма", 0);
	Результат.Вставить("ВыходовПланПоГрафикуПредставление", СтруктураОтработанноеВремя.ВыходовПланПоГрафикуПредставление);
	Результат.Вставить("ВыходовФактПредставление", СтруктураОтработанноеВремя.ВыходовФактПредставление);
	Результат.Вставить("ЧасовПланПоГрафику", СтруктураОтработанноеВремя.ЧасовПланПоГрафику);
	Результат.Вставить("ЧасовФакт", СтруктураОтработанноеВремя.ЧасовФакт);
	ТЗОклады = ПолучитьТаблицуОкладовСотрудникаЗаМесяц(Период, Сотрудник);
	Если СтруктураОтработанноеВремя.ЧасовПланПоГрафику = 0 Тогда
		Если Не ТЗОклады.Количество() = 0 Тогда 
			Результат.Сумма = ТЗОклады.Получить(0).Оклад;
		КонецЕсли;
	Иначе
		Для Каждого Стр Из СтруктураОтработанноеВремя.ТЗДанные Цикл
			// Получим расчетные данные
			ВариантОклада = Неопределено;
			ТекущийОклад = 0;
			Для Каждого СтрОклад Из ТЗОклады Цикл
				Если СтрОклад.Период > Стр.ДатаВыхода Тогда Продолжить КонецЕсли;
				ВариантОклада = СтрОклад.ВариантОклада;
				ТекущийОклад = СтрОклад.Оклад;
				Прервать;
			КонецЦикла;
			// Рассчитаем
			Если ВариантОклада = Перечисления.ВариантыОклада.Сменный Тогда
				Результат.Сумма = Результат.Сумма + (ТекущийОклад * ?(Стр.Факт=0,0,1) * Стр.Коэффициент);
			Иначе
				Если Результат.ЧасовПланПоГрафику = 0 Тогда Продолжить КонецЕсли;
				Результат.Сумма = Результат.Сумма + ?(Стр.План = 0,1,ТекущийОклад / СтруктураОтработанноеВремя.ВыходовПланПоГрафику*Стр.Факт/Стр.План*Стр.Коэффициент);
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;	
КонецФункции	

Функция РассчитатьПремию(Сотрудник, Период, Оклад, Кэш)
	// Премия сотрудника за месяц складывается из двух источников:
	//  - плановые показатели месяца (РегистрСведений.ПлановыеПоказатели, документ УстановкаПлановыхПоказателей):
	//    расчёт по выполнению плана с коэффициентами, порогами, весами и SMART-задачами - "по плану";
	//  - постоянные настройки (РегистрСведений.ПремииСотрудников, срез на конец месяца): фиксированная премия
	//    или процент от показателя продаж - "по настройке".
	// Вид премии, присутствующий в плановых показателях месяца, считается только по плану; остальные виды
	// из настроек - по настройке. Предопределенный вид ПремияПоПлану в настройках - маркер плановой модели,
	// сумма по нему не начисляется.
	ТЗПоказатели = РегистрыСведений.ПлановыеПоказатели.ПолучитьПоСотруднику(Период, Сотрудник);
	Результат = Новый Структура("Сумма, ТЗПоказатели, ТЗШтрафы", 0, СоздатьТаблицуПоказателей(), СоздатьТаблицуШтрафов());	
	РассчитатьПремиюПоПлану(Результат, ТЗПоказатели, Сотрудник, Период, Оклад, Кэш);
	РассчитатьПремиюПоНастройкам(Результат, ТЗПоказатели, Сотрудник, Период, Оклад, Кэш);
	// Итоги
	Результат.Сумма = ?(Результат.Сумма < 0, 0, ВычисленияКлиентСервер.ОкрВверх(Результат.Сумма, 0)); // Если премия меньше нуля, обнуляем, окладную часть не уменьшаем
	Возврат Результат;
КонецФункции

Процедура РассчитатьПремиюПоПлану(Результат, ТЗПоказатели, Сотрудник, Период, Оклад, Кэш)
	ПоПлану = НСтр("ru = 'По плану: ';
		|fr = 'Selon le plan : ';
		|en = 'By plan: ';
		|es = 'Según el plan: '");
	// Расчётные показатели
	МасПоказатели = ТЗПоказатели.НайтиСтроки(Новый Структура("SMART, IDРодитель", Ложь, ОбщегоНазначенияКлиентСервер.ПустойID()));	
	Для Каждого Стр Из МасПоказатели Цикл
		Если Стр.Веса Тогда			
			МасВеса = ТЗПоказатели.НайтиСтроки(Новый Структура("IDРодитель", Стр.ID));		
			Для Каждого СтрВеса Из МасВеса Цикл
				Стоимость = Окр(Стр.Стоимость / 100 * СтрВеса.Стоимость, 2);
				РасчётПоказателя = РассчитатьПоказатель(СтрВеса, Сотрудник, Период, Оклад, Стоимость, Кэш);
				Результат.Сумма = Результат.Сумма + РасчётПоказателя.Премия;
				ДобавитьРасшифровкуПоказателя(Результат.ТЗПоказатели, Сотрудник, СтрВеса.Показатель, РасчётПоказателя.Премия,
					ПоПлану + РасчётПоказателя.Пояснение, РасчётПоказателя.Комментарий);	
			КонецЦикла;
		Иначе
			РасчётПоказателя = РассчитатьПоказатель(Стр, Сотрудник, Период, Оклад, Стр.Стоимость, Кэш);
			Результат.Сумма = Результат.Сумма + РасчётПоказателя.Премия;	
			ДобавитьРасшифровкуПоказателя(Результат.ТЗПоказатели, Сотрудник, Стр.Показатель, РасчётПоказателя.Премия,
				ПоПлану + РасчётПоказателя.Пояснение, РасчётПоказателя.Комментарий);
		КонецЕсли;
	КонецЦикла;
	// SMART Задачи
	МасSMART = ТЗПоказатели.НайтиСтроки(Новый Структура("SMART, IDРодитель", Истина, ОбщегоНазначенияКлиентСервер.ПустойID()));
	Для Каждого Стр Из МасSMART Цикл
		Если Стр.Стоимость = 0 Тогда Продолжить КонецЕсли;
		Если Стр.Показатель.План Тогда
			Выполнение = Окр(Стр.Факт / Стр.План * 100);
			Выполнение = ?(Выполнение > 100, 100, Выполнение);
			Премия = Окр(Стр.Стоимость / 100 * Выполнение);
			Пояснение = "Стоимость задания: " + Стр.Стоимость + "; План: " + СокрЛП(Стр.План) + "; Факт: " + СокрЛП(Стр.Факт);
		Иначе		
			Премия = ?(Стр.Факт, Стр.Стоимость, 0);
			Пояснение = "Стоимость задания: " + Стр.Стоимость + "; " + ?(Стр.Факт, "Выполнено", "Не выполнено");			
		КонецЕсли;
		ДобавитьРасшифровкуПоказателя(Результат.ТЗПоказатели, Сотрудник, Стр.Показатель, Премия, ПоПлану + Пояснение, Стр.Комментарий);
		Результат.Сумма = Результат.Сумма + Премия;
	КонецЦикла;
КонецПроцедуры

Процедура РассчитатьПремиюПоНастройкам(Результат, ТЗПлановые, Сотрудник, Период, Оклад, Кэш)
	ПРП = ПланыВидовХарактеристик.ПоказателиРасчётаПремий;
	ТЗНастройки = ПРП.ПолучитьПоказателиПоСОтруднику(Сотрудник, КонецМесяца(Период));
	Для Каждого Стр Из ТЗНастройки Цикл
		Если ТЗПлановые.Найти(Стр.Показатель, "Показатель") <> Неопределено Тогда
			Продолжить; // Вид премии задан планом на месяц - считается по плану
		КонецЕсли;
		Если Стр.Показатель = ПРП.ПремияПоПлану Тогда
			Продолжить; // Маркер плановой модели
		КонецЕсли;
		РасчетПоказателя = РассчитатьПремиюПоНастройке(Стр, Сотрудник, Период, Оклад, Кэш);
		Результат.Сумма = Результат.Сумма + РасчетПоказателя.Премия;
		ДобавитьРасшифровкуПоказателя(Результат.ТЗПоказатели, Сотрудник, Стр.Показатель, РасчетПоказателя.Премия,
			РасчетПоказателя.Пояснение, РасчетПоказателя.Комментарий);
	КонецЦикла;
КонецПроцедуры

Функция РассчитатьПремиюПоНастройке(Стр, Сотрудник, Период, Оклад, Кэш)
	Результат = Новый Структура("Премия, Пояснение, Комментарий", 0, "", "");
	Настройки = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.НастройкиВидаПремии(Стр.Показатель);
	Если Не Настройки.АнализПродажАнализировать Тогда
		РассчитатьФиксированнуюПремию(Результат, Стр.Премия, Настройки.ПоОтработаннымДням, Оклад);
		Возврат Результат;
	КонецЕсли;
	Отбор = ОтборПродажПоНастройкеПремии(Настройки, Сотрудник, Период);
	Если Отбор = Неопределено Тогда
		Результат.Пояснение = НСтр("ru = 'По настройке: подразделение сотрудника не определено, премия не рассчитана';
		|fr = 'Selon le paramétrage : le service de l''employé n''est pas défini, la prime n''est pas calculée';
		|en = 'By setting: employee department is not defined, bonus is not calculated';
		|es = 'Según la configuración: el departamento del empleado no está definido, la prima no se calcula'");
		Возврат Результат;
	КонецЕсли;
	Если Не ПоказательПоддерживаетсяПоНастройке(Настройки.АнализПродажПоказатель) Тогда
		Результат.Пояснение = НСтр("ru = 'По настройке: показатель %1 рассчитывается только по плану';
		|fr = 'Selon le paramétrage : l''indicateur %1 n''est calculé que selon le plan';
		|en = 'By setting: indicator %1 is calculated by plan only';
		|es = 'Según la configuración: el indicador %1 se calcula solo según el plan'");
		Результат.Пояснение = СтрШаблон(Результат.Пояснение, Настройки.АнализПродажПоказатель);
		Возврат Результат;
	КонецЕсли;
	Факт = СуммаПоказателяПродаж(Кэш, Период, Отбор);
	Результат.Премия = Окр(Факт * Стр.Премия / ПроцентовВЦелом(), РазрядностьСуммы());
	Результат.Пояснение = НСтр("ru = 'По настройке: %1% от %2 (%3) в размере %4';
		|fr = 'Selon le paramétrage : %1% de %2 (%3) d''un montant de %4';
		|en = 'By setting: %1% of %2 (%3) amounting to %4';
		|es = 'Según la configuración: %1% de %2 (%3) por importe de %4'");
	Результат.Пояснение = СтрШаблон(Результат.Пояснение, СокрЛП(Стр.Премия), Настройки.АнализПродажПоказатель,
		Настройки.АнализПродажВариант, Формат(Факт, "ЧДЦ=2"));
	Возврат Результат;
КонецФункции

Процедура РассчитатьФиксированнуюПремию(Результат, Премия, ПоОтработаннымДням, Оклад)
	Если ПоОтработаннымДням И Оклад.ЧасовПланПоГрафику > 0 Тогда
		Результат.Премия = Окр(Премия * Оклад.ЧасовФакт / Оклад.ЧасовПланПоГрафику, РазрядностьСуммы());
		Результат.Пояснение = НСтр("ru = 'По настройке: премия %1 пропорционально отработанному времени (по графику: %2; отработано: %3)';
		|fr = 'Selon le paramétrage : prime %1 au prorata du temps travaillé (prévu : %2 ; travaillé : %3)';
		|en = 'By setting: bonus %1 in proportion to time worked (scheduled: %2; worked: %3)';
		|es = 'Según la configuración: prima %1 en proporción al tiempo trabajado (previsto: %2; trabajado: %3)'");
		Результат.Пояснение = СтрШаблон(Результат.Пояснение, СокрЛП(Премия), Оклад.ВыходовПланПоГрафикуПредставление,
			Оклад.ВыходовФактПредставление);
	Иначе
		Результат.Премия = Премия;
		Результат.Пояснение = НСтр("ru = 'По настройке: фиксированная премия %1';
		|fr = 'Selon le paramétrage : prime fixe %1';
		|en = 'By setting: fixed bonus %1';
		|es = 'Según la configuración: prima fija %1'");
		Результат.Пояснение = СтрШаблон(Результат.Пояснение, СокрЛП(Премия));
	КонецЕсли;
КонецПроцедуры

Функция ПроцентовВЦелом()
	Возврат 100;
КонецФункции

Функция РазрядностьСуммы()
	Возврат 2;
КонецФункции

Функция ПоказательПоПродажам(Показатель)
	// Показатели, которые считаются суммой оборотов регистра Продажи (в плановой ветке - вместо Выручка/Прибыль предка).
	ПоказателиПродаж = Перечисления.ПоказателиПродаж;
	Возврат Показатель = ПоказателиПродаж.Выручка
		Или Показатель = ПоказателиПродаж.Прибыль
		Или Показатель = ПоказателиПродаж.ЧистаяПрибыль;
КонецФункции

Функция ПоказательПоддерживаетсяПоНастройке(Показатель)
	Возврат ПоказательПоПродажам(Показатель) Или Показатель = Перечисления.ПоказателиПродаж.Количество;
КонецФункции

Функция ОтборПродажПоНастройкеПремии(Настройки, Сотрудник, Период)
	// Отбор продаж для вида премии из настроек. Возвращает Неопределено, если вариант "по подразделению"
	// задан, а подразделение сотрудника на конец месяца не найдено.
	ВариантыАнализа = Перечисления.ВариантыАнализаПоказателей;
	МасСотрудники = Новый Массив;
	Параметры = Новый Массив;
	Для Каждого Параметр Из Настройки.Параметры Цикл
		Параметры.Добавить(Параметр);
	КонецЦикла;
	Если Настройки.АнализПродажВариант = ВариантыАнализа.ПоСотруднику Тогда
		МасСотрудники.Добавить(Сотрудник);
	ИначеЕсли Настройки.АнализПродажВариант = ВариантыАнализа.ПоСотрудникам Тогда
		МасСотрудники = Настройки.Сотрудники;
	ИначеЕсли Настройки.АнализПродажВариант = ВариантыАнализа.ПоПодразделению Тогда
		Подразделение = РегистрыСведений.ТарифныеСтавки.ПолучитьДанныеСотрудника(Сотрудник, КонецМесяца(Период)).МестоХранения;
		Если Не ЗначениеЗаполнено(Подразделение) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Параметры.Добавить(Подразделение);
	ИначеЕсли Настройки.АнализПродажВариант = ВариантыАнализа.ПоПодразделениям Тогда
		Для Каждого Подразделение Из Настройки.Подразделения Цикл
			Параметры.Добавить(Подразделение);
		КонецЦикла;
	Иначе // ПоОрганизации и не заданный вариант - все продажи
		МасСотрудники = Новый Массив;
	КонецЕсли;
	Отбор = Новый Структура("Сотрудник", МасСотрудники);
	Отбор.Вставить("Показатель", Настройки.АнализПродажПоказатель);
	Отбор.Вставить("Параметры", Параметры);
	Возврат Отбор;
КонецФункции

Функция СуммаПоказателяПродаж(Кэш, Период, Отбор)
	// Сумма показателя продаж за месяц по отбору через кэш: одинаковые отборы считаются один раз,
	// отбор по одному продавцу берется из сумм по продавцам (один запрос на вид премии, а не на сотрудника).
	// Для ЧистаяПрибыль всегда выполняется отдельный запрос - затраты по продавцам не распределяются.
	НачалоПериода = НачалоМесяца(Период);
	КонецПериода = КонецМесяца(Период);
	КлючОтбора = КлючОтбораПродаж(Отбор, Ложь);
	ПоПродавцу = Отбор.Сотрудник.Количество() = 1 И Отбор.Показатель <> Перечисления.ПоказателиПродаж.ЧистаяПрибыль;
	Если ПоПродавцу Тогда
		Суммы = Кэш.СуммыПоПродавцам[КлючОтбора];
		Если Суммы = Неопределено Тогда
			Суммы = РегистрыНакопления.Продажи.ПолучитьСуммыПоказателяПродажПоПродавцам(НачалоПериода, КонецПериода, Отбор);
			Кэш.СуммыПоПродавцам.Вставить(КлючОтбора, Суммы);
		КонецЕсли;
		Сумма = Суммы[Отбор.Сотрудник[0]];
		Возврат ?(Сумма = Неопределено, 0, Сумма);
	КонецЕсли;
	КлючОтбора = КлючОтбораПродаж(Отбор, Истина);
	Сумма = Кэш.СуммыПоОтборам[КлючОтбора];
	Если Сумма = Неопределено Тогда
		Сумма = РегистрыНакопления.Продажи.ПолучитьСуммуПоказателяПродажПоПараметру(НачалоПериода, КонецПериода, Отбор);
		Кэш.СуммыПоОтборам.Вставить(КлючОтбора, Сумма);
	КонецЕсли;
	Возврат Сумма;
КонецФункции

Функция КлючОтбораПродаж(Отбор, СПродавцами)
	Ключи = Новый Массив;
	Ключи.Добавить(XMLСтрока(Отбор.Показатель));
	Для Каждого Параметр Из Отбор.Параметры Цикл
		Ключи.Добавить(XMLСтрока(Параметр));
	КонецЦикла;
	Если СПродавцами Тогда
		Для Каждого Сотрудник Из Отбор.Сотрудник Цикл
			Ключи.Добавить(XMLСтрока(Сотрудник));
		КонецЦикла;
	КонецЕсли;
	Возврат СтрСоединить(Ключи, "|");
КонецФункции

Функция РассчитатьПрочиеНачисленияУдержания(Сотрудник, Дата)
	Результат = Новый Структура("ВсегоНачислено, ВсегоУдержано", 0, 0);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Зарплата.СтатьяЗатрат КАК СтатьяЗатрат,
	                      |	СУММА(Зарплата.Сумма) КАК Сумма,
	                      |	Зарплата.ВидДвижения КАК ВидДвижения
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата КАК Зарплата
	                      |ГДЕ
	                      |	Зарплата.Сотрудник = &Сотрудник
	                      |	И НАЧАЛОПЕРИОДА(Зарплата.Период, МЕСЯЦ) = &ПериодНачисления
	                      |	И (Зарплата.Регистратор ССЫЛКА Документ.ПриказНаНачислениеУдержание)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Зарплата.СтатьяЗатрат,
	                      |	Зарплата.ВидДвижения
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Зарплата.СтатьяЗатрат.Наименование");
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат.Вставить("ТЗРасшифровка", Запрос.Выполнить().Выгрузить());
	Для Каждого Стр Из Результат.ТЗРасшифровка Цикл
		Если Стр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			Результат.ВсегоНачислено = Результат.ВсегоНачислено + Стр.Сумма;	
		Иначе
		    Результат.ВсегоУдержано = Результат.ВсегоУдержано + Стр.Сумма;
		КонецЕсли;
	КонецЦикла;	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Обслуживающие_функции

Функция РассчитатьПоказатель(Стр, Сотрудник, Период, Оклад, Стоимость, Кэш = Неопределено) Экспорт
	КэшРасчета = ?(Кэш = Неопределено, НовыйКэшРасчетаПремий(), Кэш);
	Результат = Новый Структура("План, Факт, Выполнение, ВыполнениеВЗачёт, Премия, Комментарий, Пояснение", 0, 0, 0, 0, "", "");
	Показатель = Стр.Показатель;
	Премия = 0;
	Если Не Показатель.АнализПродажАнализировать Тогда 
		Результат.План = Оклад.ЧасовПланПоГрафику;
		Если Показатель.ПоОтработаннымДням Тогда 
			Результат.Факт = Оклад.ЧасовФакт;
			Результат.Пояснение = "По графику: " + Оклад.ВыходовПланПоГрафикуПредставление + "; Отработано: " + Оклад.ВыходовФактПредставление + "; База: " + Стр.Стоимость;
		Иначе // Постоянная	
			Результат.Факт = Оклад.ЧасовПланПоГрафику;
			Результат.Пояснение = "Фиксированная премия независимо от количества отработанных дней";
		КонецЕсли;
	Иначе
		Если Стр.SMART Тогда // Только для весов
			Если Показатель.План Тогда
				//Результат.Выполнение = ВыполнениеВЗачёт;	
			Иначе		
				Результат.Комментарий = Результат.Комментарий + ?(Результат.Выполнение = 100, "Выполнено", "Не выполнено");
			КонецЕсли;		
		Иначе
			ТЗКоэффициентыПремии = Показатель.ТЧКоэффициентыПремии.Выгрузить();
			ПРП = ПланыВидовХарактеристик.ПоказателиРасчётаПремий;
			ВариантыАнализа = Перечисления.ВариантыАнализаПоказателей;
			Результат.План = ?(Стр.План = Неопределено, 0, Стр.План);
			Если (Не Показатель.План Или (Показатель.План и Стр.План > 0)) и Показатель.АнализПродажАнализировать Тогда 
				ВариантыАнализа = Перечисления.ВариантыАнализаПоказателей;
				// Формируем отбор
				МасСотрудники = Новый Массив;
				Если Показатель.АнализПродажВариант = ВариантыАнализа.ПоСотруднику Тогда
					МасСотрудники.Добавить(Сотрудник);
				ИначеЕсли Показатель.АнализПродажВариант = ВариантыАнализа.ПоСотрудникам Тогда	
					МасСотрудники = Показатель.ТЧАнализПродажСотрудники.ВыгрузитьКолонку("Сотрудник");		
				ИначеЕсли Показатель.АнализПродажВариант = ВариантыАнализа.ПоПодразделению Тогда	
					МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудниковВПодразделенииСотрудника(Сотрудник, КонецМесяца(Период));
				ИначеЕсли Показатель.АнализПродажВариант = ВариантыАнализа.ПоПодразделениям Тогда	
					МасСотрудники = РегистрыСведений.ТарифныеСтавки.ПолучитьВсехСотрудниковВПодразделениях(Показатель.ТЧАнализПродажПодразделения.ВыгрузитьКолонку("Подразделение"), КонецМесяца(Период));
				Иначе
					МасСотрудники = Новый Массив;
				КонецЕсли; 
				Отбор = Новый Структура("Сотрудник", МасСотрудники);
				Отбор.Вставить("Показатель", Показатель.АнализПродажПоказатель); 
				Отбор.Вставить("Параметры", Показатель.ТЧАнализПродажПараметры.Выгрузить().ВыгрузитьКолонку("Параметр"));
				// Получаем данные
				Если Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Оплаты Тогда
					//расчет премии от оплат независимо от плана
					Результат.Факт = РегистрыНакопления.ВзаиморасчётыСПокупателями.ПолучитьОплатыПоМенеджеру(НачалоМесяца(Период), КонецДня(КонецМесяца(Период)), Сотрудник, Отбор);
					ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, Результат.Факт);
					Результат.Пояснение = "Премия: " +СокрЛП(ПроцентПремии) + "% от " + Результат.Факт;	
					Премия = Окр(Результат.Факт / 100 * ПроцентПремии); 
				ИначеЕсли Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.ВыручкаОтОплат  Тогда 
					//расчет премии от оплат в зависимости от процента выполнения плана по отгрузкам (выручке),
					//т.е. план/факт рассчитывается от выручки, а премия считается от оплат
					Результат.Факт = РегистрыНакопления.ВзаиморасчётыСПокупателями.ПолучитьОплатыПоМенеджеру(НачалоМесяца(Период), КонецДня(КонецМесяца(Период)), Сотрудник, Отбор);
					СтруктураПоказатель = РегистрыНакопления.Продажи.ПолучитьПроцентПланаПродажПоМенеджеру(Период, Сотрудник, Показатель); 
					ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, СтруктураПоказатель.Процент);
					Результат.Пояснение = "План: " + Цел(СтруктураПоказатель.План) + "; Факт: " + Цел(СтруктураПоказатель.Факт) + "; Выполнение: " + СтруктураПоказатель.Процент + "%; Премия: " + ПроцентПремии + "% от поступивших оплат в размере " + Цел(Результат.Факт);
					Премия = Окр(Результат.Факт / 100 * ПроцентПремии); 
				ИначеЕсли ПоказательПоПродажам(Показатель.АнализПродажПоказатель) Тогда
					Результат.Факт = СуммаПоказателяПродаж(КэшРасчета, Период, Отбор);
					Результат.Выполнение = ?(Результат.План = 0, 100, Окр(Результат.Факт / Результат.План * 100, 0));
					ПояснениеДоп = ?(Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Выручка, "факта продажи", "прибыли");
					ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, Результат.Факт);
					Результат.Пояснение = "План: " + Цел(Стр.План) + "; Факт: " + Цел(Результат.Факт) + "; Выполнение: " + Результат.Выполнение + "%; Премия: " + ПроцентПремии + "% от " + ПояснениеДоп + " в размере " + Цел(Результат.Факт);
					Премия = Окр(Результат.Факт / 100 * ПроцентПремии); 
				ИначеЕсли Показатель.АнализПродажПоказатель = Перечисления.ПоказателиПродаж.Рентабельность Тогда
					//расчет премии от процента выполнения плана по рентабельности (доля % факт. от % план. рентабельности)
					ТЗПродажиПоОтгрузкам = РегистрыНакопления.Продажи.ПолучитьТаблицуПроцентыПланаРентабельностиПоМенеджеру(Период,Сотрудник,Показатель);
					Для Каждого СтрТЗПродажиПоОтгрузкам из ТЗПродажиПоОтгрузкам Цикл
						Факт = СтрТЗПродажиПоОтгрузкам.Прибыль;
						ПроцентПремии = ПланыВидовХарактеристик.ПоказателиРасчётаПремий.ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, СтрТЗПродажиПоОтгрузкам.Процент);
						Премия = Премия + Окр(Факт / 100 * ПроцентПремии);
					КонецЦикла;
					Результат.Пояснение = "План: " + Цел(Стр.План) + "; Премия в размере " + Цел(Премия);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	//
	Результат.Выполнение = ?(Результат.План = 0, 100, Окр(Результат.Факт / Результат.План * 100, 0));
	Результат.ВыполнениеВЗачёт = РассчитатьВыполнениеПланаВЗачёт(Показатель, Результат.Выполнение);
	Результат.Премия = Премия; //Окр(Стоимость / 100 * Результат.ВыполнениеВЗачёт, 2);
	// Комментарий
	Результат.Комментарий = "План: " + СокрЛП(Результат.План) + "; Факт: " + СокрЛП(Результат.Факт) + "; Выполнение: " + Результат.Выполнение + "%";
	Если Результат.Выполнение <> Результат.ВыполнениеВЗачёт Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат.Комментарий, "в зачёт " + Результат.ВыполнениеВЗачёт + "%", ", ");	
	КонецЕсли;
	// Пояснение
	Если ПустаяСтрока(Результат.Пояснение) Тогда
		Результат.Пояснение = СокрЛП(Стр.Показатель) + " - " + Результат.Премия + " от " + Стоимость + " (" + Результат.Комментарий + ")";
	КонецЕсли;
	Возврат Результат;
КонецФункции	

Функция РассчитатьВыполнениеПланаВЗачёт(Показатель, ВыполнениеРасчётное)
	Если Показатель.ПорогПланаДо > 0 и ВыполнениеРасчётное > Показатель.ПорогПланаДо Тогда 
		Результат = Показатель.ПорогПланаДо;
	ИначеЕсли ВыполнениеРасчётное < Показатель.ПорогПланаОт Тогда 	
		Результат = 0;	
	Иначе
		Результат = ВыполнениеРасчётное;	
	КонецЕсли;		
	Возврат Результат;	
КонецФункции

//Процедура РассчитатьПремиюОтСтоимостиПоказателя(ТЗУсловияПоказателя, ПланФактПоказателя, ВыполненноеЗначение, Премия, Пояснение, Процентное = Истина)
//	РасчётноеЗначение = ?(ПланФактПоказателя.План = 0, 0, Окр(ВыполненноеЗначение / ПланФактПоказателя.План * 100));
//	КоэффициентПремии = ПолучитьЗначениеПоУсловиюПоказателя(ТЗУсловияПоказателя, РасчётноеЗначение);
//	Премия = Окр(ПланФактПоказателя.Стоимость * КоэффициентПремии);
//	Пояснение = "План: " + ПланФактПоказателя.План + ?(Процентное, "%", "") + "; Факт: " + ?(Процентное, ВыполненноеЗначение, Цел(ВыполненноеЗначение)) + 
//				?(Процентное, "%", "") + "; Выполнение: " + РасчётноеЗначение + "%; Коэффициент: " + КоэффициентПремии + " от " + ПланФактПоказателя.Стоимость;		
//КонецПроцедуры
			
Функция СоздатьТаблицуШтрафов()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЗ.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗ.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыСКонтрагентами"));
	ТЗ.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	Возврат ТЗ;
КонецФункции

Функция СоздатьТаблицуПоказателей()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЗ.Колонки.Добавить("Показатель", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПоказателиРасчётаПремий"));
	ТЗ.Колонки.Добавить("SMART", Новый ОписаниеТипов("Булево"));
	ТЗ.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	ТЗ.Колонки.Добавить("Пояснение", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("Комментарий", Новый ОписаниеТипов("Строка"));
	Возврат ТЗ;
КонецФункции
			
Процедура ДобавитьРасшифровкуПоказателя(ТЗРасшифровкаПоказателей, Сотрудник, Показатель, Сумма, Пояснение, Комментарий)
	НС = ТЗРасшифровкаПоказателей.Добавить();
	НС.Сотрудник = Сотрудник;
	НС.Показатель = Показатель;
	НС.SMART = Показатель.SMART;
	НС.Сумма = Сумма;
	НС.Пояснение = Пояснение;
	НС.Комментарий = Комментарий;
КонецПроцедуры

Процедура ДобавитьРасшифровкуШтрафа(ТЗРасшифровкаШтрафов, Сотрудник, Договор, Сумма)
	НС = ТЗРасшифровкаШтрафов.Добавить();
	НС.Сотрудник = Сотрудник;
	Если Договор <> Неопределено Тогда
		НС.Контрагент = Договор.Владелец;
		НС.Договор = Договор;
	КонецЕсли;
	НС.Сумма = Сумма;	
КонецПроцедуры
			
#КонецОбласти

#Область Остатки

Функция ПолучитьТаблицуОкладовСотрудникаЗаМесяц(Период, Сотрудник)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Период КАК Период,
	                      |	ВЗ.Сотрудник,
	                      |	ВЗ.ВариантОклада,
	                      |	ВЗ.Оклад
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ЗПСрезПоследних.Период КАК Период,
	                      |		ЗПСрезПоследних.Сотрудник КАК Сотрудник,
	                      |		ЗПСрезПоследних.ВариантОклада КАК ВариантОклада,
	                      |		ЗПСрезПоследних.Оклад КАК Оклад
	                      |	ИЗ
	                      |		РегистрСведений.ТарифныеСтавки.СрезПоследних(&ДатаНач, Сотрудник = &Сотрудник) КАК ЗПСрезПоследних
						  //|	
						  //|	ОБЪЕДИНИТЬ ВСЕ
						  //|	
						  //|	ВЫБРАТЬ
						  //|		ЗП.Период,
						  //|		ЗП.Сотрудник,
						  //|		ЗП.ВариантОклада,
						  //|		ЗП.Оклад
						  //|	ИЗ
						  //|		РегистрСведений.ТарифныеСтавки КАК ЗП
						  //|	ГДЕ
						  //|		ЗП.Период МЕЖДУ &ДатаНач И &ДатаКон
						  //|		И ЗП.Сотрудник = &Сотрудник
	                      |) КАК ВЗ
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецМесяца(Период)));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьОстаткиПоСотрудникам(Объект, МасСотрудники) Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Сотрудник КАК Сотрудник,
	                      |	СУММА(ВЗ.Сумма) КАК Сумма,
	                      |	ВЗ.СотрудникНаименование КАК СотрудникНаименование
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ЗарплатаОстатки.Сотрудник КАК Сотрудник,
	                      |		ЗарплатаОстатки.СуммаОстаток КАК Сумма,
	                      |		ЗарплатаОстатки.Сотрудник.Наименование КАК СотрудникНаименование
	                      |	ИЗ
	                      |		РегистрНакопления.Зарплата.Остатки(
	                      |				&НаДату,
	                      |				ВЫБОР
	                      |					КОГДА &ПоСпискуСотрудников
	                      |						ТОГДА Сотрудник В (&МасСотрудники)
	                      |					ИНАЧЕ ИСТИНА
	                      |				КОНЕЦ) КАК ЗарплатаОстатки
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ЗарплатаОбороты.Сотрудник,
	                      |		ЗарплатаОбороты.СуммаОборот,
	                      |		ЗарплатаОбороты.Сотрудник.Наименование
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			СУММА(ЗарплатаОбороты.СуммаОборот) КАК СуммаОборот,
	                      |			ЗарплатаОбороты.Сотрудник КАК Сотрудник
	                      |		ИЗ
	                      |			РегистрНакопления.Зарплата.Обороты(
	                      |					НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
	                      |					КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),
	                      |					Регистратор,
	                      |					ВЫБОР
	                      |						КОГДА &ПоСпискуСотрудников
	                      |							ТОГДА Сотрудник В (&МасСотрудники)
	                      |						ИНАЧЕ ИСТИНА
	                      |					КОНЕЦ) КАК ЗарплатаОбороты
	                      |		ГДЕ
	                      |			НЕ ЗарплатаОбороты.Регистратор = &Регистратор
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ЗарплатаОбороты.Сотрудник) КАК ЗарплатаОбороты) КАК ВЗ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЗ.Сотрудник,
	                      |	ВЗ.СотрудникНаименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВЗ.СотрудникНаименование");
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(НачалоМесяца(Объект.Дата)-1));
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("МасСотрудники",МасСотрудники);
	Запрос.УстановитьПараметр("ПоСпискуСотрудников",Не МасСотрудники.Количество() = 0);
	Запрос.УстановитьПараметр("Регистратор",Объект.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти
